Revit 2024 API
gbXMLOpeningType Enumeration
 This enumeration corresponds to the openingType attribute in gbXML and identifies the type of opening defined.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public enum gbXMLOpeningType
Visual Basic
Public Enumeration gbXMLOpeningType
Visual C++
public enum class gbXMLOpeningType
Members
Member name | Description
FixedWindow |  Fixed window.
OperableWindow |  Operable window.
FixedSkylight |  Fixed skylight.
OperableSkylight |  Operable skylight.
SlidingDoor |  Sliding door.
NonSlidingDoor |  Non sliding door.
OpeningAir |  Opening air.
NoOfOpeningTypes |  No of opening types.
See Also
Autodesk.Revit.DB.Analysis Namespace